
## Plan Result

[CI link](https://github.com/marwenbhriz/ga-terraform/actions/runs/9891804899)


<pre><code>Plan: 3 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.gce.google_compute_instance.default[0]
  * module.gke.google_container_cluster.ga-cluster
  * module.gke.google_container_node_pool.default[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.gce.google_compute_instance.default[0] will be created
  + resource "google_compute_instance" "default" {
      + can_ip_forward          = false
      + cpu_platform            = (known after apply)
      + current_status          = (known after apply)
      + deletion_protection     = false
      + effective_labels        = (known after apply)
      + guest_accelerator       = (known after apply)
      + id                      = (known after apply)
      + instance_id             = (known after apply)
      + label_fingerprint       = (known after apply)
      + machine_type            = "e2-small"
      + metadata_fingerprint    = (known after apply)
      + metadata_startup_script = "modules/gce/compute_instance_startup.sh"
      + min_cpu_platform        = (known after apply)
      + name                    = "jump-ops-01"
      + project                 = "grasys-study"
      + self_link               = (known after apply)
      + tags                    = [
          + "ga-firewall",
        ]
      + tags_fingerprint        = (known after apply)
      + terraform_labels        = (known after apply)
      + zone                    = "asia-northeast1-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image                  = "centos-cloud/centos-7"
              + labels                 = (known after apply)
              + provisioned_iops       = (known after apply)
              + provisioned_throughput = (known after apply)
              + size                   = (known after apply)
              + type                   = (known after apply)
            }
        }

      + confidential_instance_config {
          + confidential_instance_type  = (known after apply)
          + enable_confidential_compute = (known after apply)
        }

      + network_interface {
          + internal_ipv6_prefix_length = (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          + name                        = (known after apply)
          + network                     = "https://www.googleapis.com/compute/v1/projects/grasys-study/global/networks/ga-vpc"
          + network_ip                  = (known after apply)
          + stack_type                  = (known after apply)
          + subnetwork                  = "https://www.googleapis.com/compute/v1/projects/grasys-study/regions/asia-northeast1/subnetworks/ga-subnetwork"
          + subnetwork_project          = (known after apply)
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart           = (known after apply)
          + instance_termination_action = (known after apply)
          + min_node_cpus               = (known after apply)
          + on_host_maintenance         = (known after apply)
          + preemptible                 = (known after apply)
          + provisioning_model          = (known after apply)

          + local_ssd_recovery_timeout {
              + nanos   = (known after apply)
              + seconds = (known after apply)
            }

          + max_run_duration {
              + nanos   = (known after apply)
              + seconds = (known after apply)
            }

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }

          + on_instance_stop_action {
              + discard_local_ssd = (known after apply)
            }
        }
    }

  # module.gke.google_container_cluster.ga-cluster will be created
  + resource "google_container_cluster" "ga-cluster" {
      + cluster_ipv4_cidr           = (known after apply)
      + datapath_provider           = (known after apply)
      + default_max_pods_per_node   = 100
      + enable_binary_authorization = false
      + enable_fqdn_network_policy  = false
      + enable_intranode_visibility = (known after apply)
      + enable_kubernetes_alpha     = false
      + enable_l4_ilb_subsetting    = false
      + enable_legacy_abac          = false
      + enable_multi_networking     = false
      + enable_shielded_nodes       = true
      + enable_tpu                  = (known after apply)
      + endpoint                    = (known after apply)
      + id                          = (known after apply)
      + initial_node_count          = 1
      + label_fingerprint           = (known after apply)
      + location                    = "asia-northeast1"
      + logging_service             = (known after apply)
      + master_version              = (known after apply)
      + monitoring_service          = (known after apply)
      + name                        = "ga-gke"
      + network                     = "https://www.googleapis.com/compute/v1/projects/grasys-study/global/networks/ga-vpc"
      + networking_mode             = "VPC_NATIVE"
      + node_locations              = [
          + "asia-northeast1-a",
          + "asia-northeast1-b",
          + "asia-northeast1-c",
        ]
      + node_version                = (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      + project                     = "grasys-study"
      + remove_default_node_pool    = false
      + self_link                   = (known after apply)
      + services_ipv4_cidr          = (known after apply)
      + subnetwork                  = "https://www.googleapis.com/compute/v1/projects/grasys-study/regions/asia-northeast1/subnetworks/ga-subnetwork"
      + tpu_ipv4_cidr_block         = (known after apply)

      + addons_config {
          + cloudrun_config {
              + disabled           = (known after apply)
              + load_balancer_type = (known after apply)
            }

          + config_connector_config {
              + enabled = (known after apply)
            }

          + dns_cache_config {
              + enabled = (known after apply)
            }

          + gce_persistent_disk_csi_driver_config {
              + enabled = (known after apply)
            }

          + gcp_filestore_csi_driver_config {
              + enabled = (known after apply)
            }

          + gcs_fuse_csi_driver_config {
              + enabled = (known after apply)
            }

          + gke_backup_agent_config {
              + enabled = (known after apply)
            }

          + horizontal_pod_autoscaling {
              + disabled = (known after apply)
            }

          + http_load_balancing {
              + disabled = false
            }

          + istio_config {
              + auth     = (known after apply)
              + disabled = (known after apply)
            }

          + kalm_config {
              + enabled = (known after apply)
            }

          + network_policy_config {
              + disabled = (known after apply)
            }
        }

      + authenticator_groups_config {
          + security_group = (known after apply)
        }

      + cluster_autoscaling {
          + autoscaling_profile = "BALANCED"
          + enabled             = true

          + auto_provisioning_defaults {
              + boot_disk_kms_key = (known after apply)
              + disk_size         = (known after apply)
              + disk_type         = (known after apply)
              + image_type        = (known after apply)
              + min_cpu_platform  = (known after apply)
              + oauth_scopes      = (known after apply)
              + service_account   = (known after apply)

              + management {
                  + auto_repair     = (known after apply)
                  + auto_upgrade    = (known after apply)
                  + upgrade_options = (known after apply)
                }

              + shielded_instance_config {
                  + enable_integrity_monitoring = (known after apply)
                  + enable_secure_boot          = (known after apply)
                }

              + upgrade_settings {
                  + max_surge       = (known after apply)
                  + max_unavailable = (known after apply)
                  + strategy        = (known after apply)

                  + blue_green_settings {
                      + node_pool_soak_duration = (known after apply)

                      + standard_rollout_policy {
                          + batch_node_count    = (known after apply)
                          + batch_percentage    = (known after apply)
                          + batch_soak_duration = (known after apply)
                        }
                    }
                }
            }

          + resource_limits {
              + maximum       = 2
              + minimum       = 1
              + resource_type = "cpu"
            }
          + resource_limits {
              + maximum       = 6
              + resource_type = "memory"
            }
        }

      + cluster_telemetry {
          + type = (known after apply)
        }

      + confidential_nodes {
          + enabled = (known after apply)
        }

      + cost_management_config {
          + enabled = (known after apply)
        }

      + database_encryption {
          + key_name = (known after apply)
          + state    = (known after apply)
        }

      + default_snat_status {
          + disabled = (known after apply)
        }

      + gateway_api_config {
          + channel = (known after apply)
        }

      + identity_service_config {
          + enabled = (known after apply)
        }

      + ip_allocation_policy {
          + cluster_ipv4_cidr_block       = (known after apply)
          + cluster_secondary_range_name  = (known after apply)
          + services_ipv4_cidr_block      = (known after apply)
          + services_secondary_range_name = (known after apply)
          + stack_type                    = "IPV4"

          + pod_cidr_overprovision_config {
              + disabled = (known after apply)
            }
        }

      + logging_config {
          + enable_components = (known after apply)
        }

      + master_auth {
          + client_certificate     = (known after apply)
          + client_key             = (sensitive value)
          + cluster_ca_certificate = (known after apply)

          + client_certificate_config {
              + issue_client_certificate = (known after apply)
            }
        }

      + master_authorized_networks_config {
          + gcp_public_cidrs_access_enabled = (known after apply)

          + cidr_blocks {
              + cidr_block   = (known after apply)
              + display_name = (known after apply)
            }
        }

      + mesh_certificates {
          + enable_certificates = false
        }

      + monitoring_config {
          + enable_components = (known after apply)

          + advanced_datapath_observability_config {
              + enable_metrics = (known after apply)
              + relay_mode     = (known after apply)
            }

          + managed_prometheus {
              + enabled = (known after apply)
            }
        }

      + node_config {
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + logging_variant   = "DEFAULT"
          + machine_type      = "e2-small"
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/cloud-platform",
              + "https://www.googleapis.com/auth/devstorage.read_only",
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring",
              + "https://www.googleapis.com/auth/service.management.readonly",
              + "https://www.googleapis.com/auth/servicecontrol",
              + "https://www.googleapis.com/auth/trace.append",
            ]
          + preemptible       = false
          + service_account   = (known after apply)
          + spot              = true
          + tags              = [
              + "ga",
            ]
          + taint             = (known after apply)

          + confidential_nodes {
              + enabled = (known after apply)
            }

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + workload_metadata_config {
              + mode = (known after apply)
            }
        }

      + node_pool {
          + initial_node_count          = (known after apply)
          + instance_group_urls         = (known after apply)
          + managed_instance_group_urls = (known after apply)
          + max_pods_per_node           = (known after apply)
          + name                        = (known after apply)
          + name_prefix                 = (known after apply)
          + node_count                  = (known after apply)
          + node_locations              = (known after apply)
          + version                     = (known after apply)

          + autoscaling {
              + location_policy      = (known after apply)
              + max_node_count       = (known after apply)
              + min_node_count       = (known after apply)
              + total_max_node_count = (known after apply)
              + total_min_node_count = (known after apply)
            }

          + management {
              + auto_repair  = (known after apply)
              + auto_upgrade = (known after apply)
            }

          + network_config {
              + create_pod_range     = (known after apply)
              + enable_private_nodes = (known after apply)
              + pod_ipv4_cidr_block  = (known after apply)
              + pod_range            = (known after apply)

              + additional_node_network_configs {
                  + network    = (known after apply)
                  + subnetwork = (known after apply)
                }

              + additional_pod_network_configs {
                  + max_pods_per_node   = (known after apply)
                  + secondary_pod_range = (known after apply)
                  + subnetwork          = (known after apply)
                }

              + pod_cidr_overprovision_config {
                  + disabled = (known after apply)
                }
            }

          + node_config {
              + boot_disk_kms_key = (known after apply)
              + disk_size_gb      = (known after apply)
              + disk_type         = (known after apply)
              + guest_accelerator = (known after apply)
              + image_type        = (known after apply)
              + labels            = (known after apply)
              + local_ssd_count   = (known after apply)
              + logging_variant   = (known after apply)
              + machine_type      = (known after apply)
              + metadata          = (known after apply)
              + min_cpu_platform  = (known after apply)
              + node_group        = (known after apply)
              + oauth_scopes      = (known after apply)
              + preemptible       = (known after apply)
              + resource_labels   = (known after apply)
              + service_account   = (known after apply)
              + spot              = (known after apply)
              + tags              = (known after apply)
              + taint             = (known after apply)

              + advanced_machine_features {
                  + threads_per_core = (known after apply)
                }

              + confidential_nodes {
                  + enabled = (known after apply)
                }

              + ephemeral_storage_config {
                  + local_ssd_count = (known after apply)
                }

              + ephemeral_storage_local_ssd_config {
                  + local_ssd_count = (known after apply)
                }

              + fast_socket {
                  + enabled = (known after apply)
                }

              + gcfs_config {
                  + enabled = (known after apply)
                }

              + gvnic {
                  + enabled = (known after apply)
                }

              + host_maintenance_policy {
                  + maintenance_interval = (known after apply)
                }

              + kubelet_config {
                  + cpu_cfs_quota        = (known after apply)
                  + cpu_cfs_quota_period = (known after apply)
                  + cpu_manager_policy   = (known after apply)
                  + pod_pids_limit       = (known after apply)
                }

              + linux_node_config {
                  + sysctls = (known after apply)
                }

              + local_nvme_ssd_block_config {
                  + local_ssd_count = (known after apply)
                }

              + reservation_affinity {
                  + consume_reservation_type = (known after apply)
                  + key                      = (known after apply)
                  + values                   = (known after apply)
                }

              + sandbox_config {
                  + sandbox_type = (known after apply)
                }

              + shielded_instance_config {
                  + enable_integrity_monitoring = (known after apply)
                  + enable_secure_boot          = (known after apply)
                }

              + sole_tenant_config {
                  + node_affinity {
                      + key      = (known after apply)
                      + operator = (known after apply)
                      + values   = (known after apply)
                    }
                }

              + workload_metadata_config {
                  + mode = (known after apply)
                }
            }

          + placement_policy {
              + policy_name  = (known after apply)
              + tpu_topology = (known after apply)
              + type         = (known after apply)
            }

          + upgrade_settings {
              + max_surge       = (known after apply)
              + max_unavailable = (known after apply)
              + strategy        = (known after apply)

              + blue_green_settings {
                  + node_pool_soak_duration = (known after apply)

                  + standard_rollout_policy {
                      + batch_node_count    = (known after apply)
                      + batch_percentage    = (known after apply)
                      + batch_soak_duration = (known after apply)
                    }
                }
            }
        }

      + node_pool_auto_config {
          + network_tags {
              + tags = (known after apply)
            }
        }

      + node_pool_defaults {
          + node_config_defaults {
              + logging_variant = (known after apply)

              + gcfs_config {
                  + enabled = (known after apply)
                }
            }
        }

      + notification_config {
          + pubsub {
              + enabled = true
              + topic   = "projects/grasys-study/topics/ga-notifications"
            }
        }

      + private_cluster_config {
          + enable_private_endpoint = true
          + enable_private_nodes    = true
          + master_ipv4_cidr_block  = "10.0.1.0/28"
          + peering_name            = (known after apply)
          + private_endpoint        = (known after apply)
          + public_endpoint         = (known after apply)

          + master_global_access_config {
              + enabled = (known after apply)
            }
        }

      + protect_config {
          + workload_vulnerability_mode = (known after apply)

          + workload_config {
              + audit_mode = (known after apply)
            }
        }

      + release_channel {
          + channel = (known after apply)
        }

      + security_posture_config {
          + mode               = (known after apply)
          + vulnerability_mode = (known after apply)
        }

      + service_external_ips_config {
          + enabled = (known after apply)
        }

      + tpu_config {
          + enabled                = (known after apply)
          + ipv4_cidr_block        = (known after apply)
          + use_service_networking = (known after apply)
        }

      + vertical_pod_autoscaling {
          + enabled = true
        }

      + workload_identity_config {
          + workload_pool = (known after apply)
        }
    }

  # module.gke.google_container_node_pool.default[0] will be created
  + resource "google_container_node_pool" "default" {
      + cluster                     = (known after apply)
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = "asia-northeast1"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = 20
      + name                        = "nodepool-01"
      + name_prefix                 = (known after apply)
      + node_count                  = 1
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = "grasys-study"
      + version                     = (known after apply)

      + autoscaling {
          + location_policy = (known after apply)
          + max_node_count  = 1
          + min_node_count  = 1
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = true
        }

      + network_config {
          + create_pod_range     = (known after apply)
          + enable_private_nodes = (known after apply)
          + pod_ipv4_cidr_block  = (known after apply)
          + pod_range            = (known after apply)

          + network_performance_config {
              + total_egress_bandwidth_tier = (known after apply)
            }

          + pod_cidr_overprovision_config {
              + disabled = (known after apply)
            }
        }

      + node_config {
          + boot_disk_kms_key           = (known after apply)
          + disk_size_gb                = (known after apply)
          + disk_type                   = (known after apply)
          + effective_taints            = (known after apply)
          + enable_confidential_storage = (known after apply)
          + guest_accelerator           = (known after apply)
          + image_type                  = (known after apply)
          + labels                      = (known after apply)
          + local_ssd_count             = (known after apply)
          + logging_variant             = (known after apply)
          + machine_type                = (known after apply)
          + metadata                    = (known after apply)
          + min_cpu_platform            = (known after apply)
          + node_group                  = (known after apply)
          + oauth_scopes                = (known after apply)
          + preemptible                 = (known after apply)
          + resource_labels             = (known after apply)
          + resource_manager_tags       = (known after apply)
          + service_account             = (known after apply)
          + spot                        = (known after apply)
          + tags                        = (known after apply)

          + advanced_machine_features {
              + enable_nested_virtualization = (known after apply)
              + threads_per_core             = (known after apply)
            }

          + confidential_nodes {
              + enabled = (known after apply)
            }

          + containerd_config {
              + private_registry_access_config {
                  + enabled = (known after apply)

                  + certificate_authority_domain_config {
                      + fqdns = (known after apply)

                      + gcp_secret_manager_certificate_config {
                          + secret_uri = (known after apply)
                        }
                    }
                }
            }

          + ephemeral_storage_local_ssd_config {
              + local_ssd_count = (known after apply)
            }

          + fast_socket {
              + enabled = (known after apply)
            }

          + gcfs_config {
              + enabled = (known after apply)
            }

          + gvnic {
              + enabled = (known after apply)
            }

          + host_maintenance_policy {
              + maintenance_interval = (known after apply)
            }

          + kubelet_config {
              + cpu_cfs_quota        = (known after apply)
              + cpu_cfs_quota_period = (known after apply)
              + cpu_manager_policy   = (known after apply)
              + pod_pids_limit       = (known after apply)
            }

          + linux_node_config {
              + cgroup_mode = (known after apply)
              + sysctls     = (known after apply)
            }

          + local_nvme_ssd_block_config {
              + local_ssd_count = (known after apply)
            }

          + reservation_affinity {
              + consume_reservation_type = (known after apply)
              + key                      = (known after apply)
              + values                   = (known after apply)
            }

          + secondary_boot_disks {
              + disk_image = (known after apply)
              + mode       = (known after apply)
            }

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + sole_tenant_config {
              + node_affinity {
                  + key      = (known after apply)
                  + operator = (known after apply)
                  + values   = (known after apply)
                }
            }

          + taint {
              + effect = (known after apply)
              + key    = (known after apply)
              + value  = (known after apply)
            }

          + workload_metadata_config {
              + mode = (known after apply)
            }
        }

      + upgrade_settings {
          + max_surge       = (known after apply)
          + max_unavailable = (known after apply)
          + strategy        = (known after apply)

          + blue_green_settings {
              + node_pool_soak_duration = (known after apply)

              + standard_rollout_policy {
                  + batch_node_count    = (known after apply)
                  + batch_percentage    = (known after apply)
                  + batch_soak_duration = (known after apply)
                }
            }
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform-plan","PRNumber":3,"Program":"tfcmt","SHA1":"08bb6b73bd19c80d05fd9fed51415ecb4f421579","Vars":{},"WorkflowName":"terraform plan"} -->